Repository: sillybean/HTML-Import-2
Catalog: languages/import-html-pages-*.po
Languages: fr_fr

source: HTML Import Settings
fr_fr: Réglages d'Import HTML

source: Welcome to HTML Import! This is a complicated importer with many options. Please look through all the tabs on this page before running your import.
fr_fr: Bienvenue sur Import HTML ! Ce plugin complexe d'import comporte de nombreuses options. Consultez tous les onglets de cette page avant de lancer votre import.

source: Files
fr_fr: Fichiers

source: Content
fr_fr: Contenu

source: Title &amp; Metadata
fr_fr: Titre & Métadata

source: Custom Fields
fr_fr: Champs personnalisés

source: Categories &amp; Tags
fr_fr: Catégories & Tags

source: Tools
fr_fr: Outils

source: Directory to import
fr_fr: Répertoire à importer

source: The absolute path to the files you want to import.
fr_fr: Le chemin absolu vers les fichiers que vous souhaitez importer

source: Hint: the absolute path to this WordPress installation is: %s
fr_fr: Astuce : le chemin vers cette installation WordPress est : %s

source: Old site URL
fr_fr: URL de l'ancien site

source: This will be used only to generate accurate <kbd>.htaccess</kbd> redirects. The importer will not search for files here.
fr_fr: Sera utilisé uniquement pour générer les redirections <kbd>.htaccess</kbd> exactes. L'import ne cherchera pas les fichiers à cette URL.

source: Default file
fr_fr: Page par défaut

source: Enter the name of the default file ( index.html, default.htm ) for directories on this server.
fr_fr: Entrez le nom de la page par défaut (index.html, default.htm) pour ce serveur.

source: File extensions to include
fr_fr: Extensions de fichier à inclure

source: File extensions, without periods, separated by commas. All other file types will be ignored.
fr_fr: Extensions de fichier, sans point, séparés par des virgules. Tout autre type de fichier sera ignoré.

source: Directories to exclude
fr_fr: Répertoires à exclure

source: Directory names, without slashes, separated by commas. All files in these directories will be ignored.
fr_fr: Noms de répertoires, sans slash, séparés par des virgules. Tous les fichiers dans ces répertoires seront ignorés.

source: Preserve file names
fr_fr: Préserver les noms de fichiers

source: Use the file's name as the imported page's slug
fr_fr: Utiliser le nom du fichier comme slug de la page importée.

source: The slug will not include the file extension. To completely mimic your old URLs, add the extension to your permalink structure.
fr_fr: Le slug n'incluera pas l'extension de fichier. Pour recréer complètement vos anciennes URL, ajoutez l'extension dans votre structure permalink.

source: Select content by
fr_fr: Sélectionner le contenu avec

source: HTML tag
fr_fr: Balise HTML

source: Dreamweaver template region
fr_fr: Région de template Dreamweaver

source: Import entire file
fr_fr: Importer le fichier entier

source: Tag
fr_fr: Balise

source: The HTML tag, without brackets
fr_fr: La balise HTML, sans délimiteurs

source: Attribute
fr_fr: Attribut

source: Leave blank to use a tag without an attribute, or when the attributes don't matter, such as &lt;body&gt;
fr_fr: Laissez blanc pour utiliser une balise sans attribut, ou lorsque l'attribut n'importe pas, comme pour &lt;body&gt;

source: = Value
fr_fr: = Valeur

source: Enter the attribute's value ( such as width, ID, or class name ) without quotes
fr_fr: Entrez la valeur de l'attribut sans guillemets (comme le nom de classe, l'identifiant,..)

source: The name of the editable region ( e.g. 'Main Content' )
fr_fr: Le nom de la région éditable (ex : 'Main Content')

source: More content options
fr_fr: Plus d'options de contenu

source: Import linked images
fr_fr: Importer les images liées

source: Remove responsive image srcsets
fr_fr: Supprimer les srcsets images responsives

source: Import linked documents
fr_fr: Importer les documents liés

source: Allowed file types
fr_fr: Types de fichiers autorisés

source: Enter file extensions without periods, separated by commas. File types not listed here will not be imported to the media library. Use '*' for all file extensions (except those imported).<br /> Suggested: rtf, doc, docx, xls, xlsx, csv, ppt, pps, pptx, ppsx, pdf, zip, wmv, avi, flv, mov, mpeg, mp3, m4a, wav<br />
fr_fr: Entrez les extensions, sans point, séparées par des virgules. Les types de fichiers non listés ici ne seront pas importés. Utilisez '*' pour importer toutes les extensions (sauf celles importées en articles).<br /> Suggestion : rtf, doc, docx, xls, xlsx, csv, ppt, pps, pptx, ppsx, pdf, zip, wmv, avi, flv, mov, mpeg, mp3, m4a, wav<br />

source: Update internal links
fr_fr: Mettre à jour les liens internes

source: Use meta description as excerpt
fr_fr: Utiliser la meta description comme extrait

source: Convert special characters ( accents and symbols )
fr_fr: Convertir les caractères spéciaux (accents et symboles)

source: Clean up bad ( Word, Frontpage ) HTML
fr_fr: Nettoyer le HTML sale (Word, Frontpage)

source: Allowed HTML
fr_fr: HTML autorisé

source: Enter tags ( with brackets ) to be preserved. All tags not listed here will be removed. <br />Suggested:
fr_fr: Entrez les balises à conserver (sans délimiteurs). Tous les tags non listés ici seront supprimés. <br />Suggestion :

source: If you have data tables, also include:
fr_fr: Si vous avez des tableaux, incluez également :

source: Allowed attributes
fr_fr: Attributs autorisés

source: Enter attributes separated by commas. All attributes not listed here will be removed. <br />Suggested: href, src, alt, title<br /> <em>If you have data tables, also include:</em> summary, rowspan, colspan, span
fr_fr: Entrez les attributs séparés par des virgules. Tous les attributs non listés ici seront supprimés. <br />Suggestion : href,src,alt,title<br /> <em>Si vous avez des tableaux, incluez également :</em> summary,rowspan,colspan,span

source: Select title by
fr_fr: Sélectionner le titre par

source: File name
fr_fr: Nom de fichier

source: Leave blank to use a tag without an attribute, or when the attributes don't matter, such as &lt;title&gt;
fr_fr: Laissez vide pour utiliser une balise sans attribut, ou lorsque l'attribut n'importe pas, comme pour &lt;title&gt;

source: The name of the editable region ( e.g. 'Page Title' )
fr_fr: Le nom de la région éditable (ex : 'Page Title')

source: Phrase to remove from page title:
fr_fr: Partie à supprimer du titre de la page :

source: Any common title phrase ( such as the site name, which most themes will print automatically )
fr_fr: Une phrase fixe (comme le nom du site, que la majorité des thèmes vont ajouter automatiquement)

source: Title position
fr_fr: Position du titre

source: The title is inside the content area and should be removed from the post body
fr_fr: Le titre est dans la zone de contenu et doit être supprimée du corps de l'article

source: Import files as
fr_fr: Importer les fichiers comme

source: Set status to
fr_fr: Mettre le statut à

source: publish
fr_fr: publié

source: draft
fr_fr: brouillon

source: private
fr_fr: privé

source: pending
fr_fr: en attente

source: Set timestamps to
fr_fr: Régler la date à

source: now
fr_fr: aujourd'hui

source: last time the file was modified
fr_fr: la date de dernière modification du fichier

source: custom field
fr_fr: champ personnalisé

source: Set author to
fr_fr: Mettre l'auteur à

source: Import pages as children of:
fr_fr: Importer les pages comme filles de :

source: None ( top level )
fr_fr: Aucun (niveau racine)

source: Template for imported pages:
fr_fr: Template pour les pages importées :

source: Default Template
fr_fr: Template par défaut

source: Select date by
fr_fr: Sélectionner la date par

source: Custom fields
fr_fr: Champs personnalisés

source: Custom field name
fr_fr: Nom de champ personnalisé

source: Allow HTML
fr_fr: Autorise le HTML

source: Select field by:
fr_fr: Sélectionner le champ par :

source: Here, you may assign categories, tags, and custom taxonomy terms to all your imported posts.
fr_fr: Ici vous pouvez assigner des catégories, tags et autres termes personnalisés à tous vos articles importés.

source: To import tags from a region in each file, use a custom field with the name <kbd>post_tag</kbd>.
fr_fr: Pour importer des tags depuis une partie des fichiers, utilisez un champ personnalisé avec le nom <kbd>post_tags</kbd>

source: Regenerate <kbd>.htaccess</kbd> redirects
fr_fr: Regénérer les redirections <kbd>.htaccess</kbd>

source: If you <a href="%s">changed your permalink structure</a> after you imported files, you can <a href="%s">regenerate the redirects</a>.
fr_fr: Si vous <a href="%s">changez votre structure permalink</a> après avoir importé des articles, vous pouvez <a href="%s">regénérer les redirections</a>.

source: Other helpful plugins
fr_fr: Autres plugins utiles

source: <a href="%s">Broken Link Checker</a> finds broken links and references to missing media files. Since the importer does not handle links or media files other than images, you should run this to see what else needs to be copied or updated from your old site.
fr_fr: <a href="%s">Broken Link Checker</a> trouve les liens cassés et référence les fichiers manquants. Comme l'import ne gère pas les liens ou les fichiers autres que les images, vous devriez utiliser ceci pour voir ce qui doit être copié ou mis à jour à partir de votre ancien site.

source: <a href="%s">Search and Replace</a> helps you fix many broken links at once, if you have many links to the same files or if there is a pattern ( like <kbd>&lt;a href="../../files"&gt;</kbd> ) to your broken links.
fr_fr: <a href="%s">Search and Replace</a> vous aide à corriger des liens cassés s'il existe un pattern de remplacement (comme <kbd>&lt;a href="../../files"&gt;</kbd>) pour vos liens cassés.

source: <a href="%s">Redirection</a> provides a nice admin interface for managing redirects. If you would rather not edit your <kbd>.htaccess</kbd> file, or if you just want to redirect one or two of your old pages, you can ignore the redirects generated by the importer. Instead, copy the post's old URL from the custom fields and paste it into Redirection's options.
fr_fr: <a href="%s">Redirection</a> fournit une interface d'administration pour gérer vos redirections. Si vous ne voulez pas éditer votre fichier <kbd>.htaccess</kbd>, ou si vous voulez juste rediriger une ou deux de vos anciennes pages, vous pouvez ignorer les redirections générées par l'import, et copier les anciennes adresses depuis les champs personnalisés et les coller dans les options de redirection.

source: <a href="%s">Add from Server</a> lets you import media files that are on your server but not part of the WordPress media library.
fr_fr: <a href="%s">Add from Server</a> vous permet d'importer des fichiers qui sont sur votre server mais qui ne font pas partie de la media library WordPress.

source: <a href="%s">Add Linked Images to Gallery</a> is helpful if you have imported data using other plugins and you would like to import linked images. However, it handles only images that are referenced with complete URLs; relative paths will not work.
fr_fr: <a href="%s">Add Linked Images to Gallery</a> est utile i vous avez importé des données via d'autres plugins et que vous voulez importer également les images liées. Malheureusement, il ne permet d'importer que les images référencées via une URL complètes : les URL relatives ne seront pas importées.

source: Donate
fr_fr: Donner

source: If this importer has saved you hours of copying and pasting, a <a href="%s">donation toward future development</a> would be much appreciated!
fr_fr: Si ce plugin d'import vous a fait gagner de nombreuses heures de copier/coller, un <a href="%s">don pour les développements futurs</a> sera très apprécié !

source: Save settings
fr_fr: Sauvegarder les réglages

source: The beginning directory you entered is not an absolute path. Relative paths are not allowed here.
fr_fr: Le répertoire de départ que vous avez entré n'est pas un chemin absolu. Les chemins relatifs ne sont pas autorisés ici.

source: You did not enter an HTML content tag to import.
fr_fr: Vous n'avez pas entré une balise HTML d'import du contenu.

source: You did not enter a Dreamweaver content template region to import.
fr_fr: Vous n'avez pas entré la région du template Dreamweaver à importer comme contenu.

source: You did not enter an HTML title tag to import.
fr_fr: Vous n'avez pas entré la balise HTML du titre à importer.

source: You did not enter a Dreamweaver title template region to import.
fr_fr: Vous n'avez pas entré la région du template Dreamweaver du titre à importer.

source: If you intend to <a href="%s">set a permalink structure</a>, you should do it before importing so the <kbd>.htaccess</kbd> redirects will be accurate.
fr_fr: Si vous envisagez de <a href="%s">changer la structure permalink </a>, vous devriez le faire avant l'import pour que les redirections <kbd>.htaccess</kbd> soient correctes.

source: Settings saved. %s <a href="%s">Ready to import files?</a>
fr_fr: Réglages sauvegardés. %s <a href="%s">Prêt à importer vos fichiers ?</a>

source: Imports well-formed static HTML files into WordPress posts or pages. Supports Dreamweaver templates and Word HTML cleanup. Visit the settings page to get started. See the <a href="http://sillybean.net/code/wordpress/html-import-2/user-guide/">User Guide</a> for details.
fr_fr: Importer des pages HTML statiques bien formées en articles ou pages WordPress. Supporte des templates Dreamweaver et le nettoyage du HTML de Word. Consulter la page de configuration pour commencer. Lire le <a href="http://sillybean.net/code/wordpress/html-import-2/user-guide/">manuel d'utilisation</a> pour plus d'information.

source: HTML Import
fr_fr: Import HTML

source: This is a complicated importer with lots of options. If you have never used this importer before, you should take a look at the <a href="%s">User Guide</a>.
fr_fr: Ce plugin d'import complexe comporte un grand nombre d'options. Si c'est votre première utilisation, vous devriez consulter le <a href="%s">guide d'utilisation</a>.

source: You need to look through the first five tabs and save your settings before you run the importer. The sixth ( Tools ) contains links to some tools that are helpful after you've imported.
fr_fr: Vous devez regarder les cinq premiers onglets et sauvegarder vos réglages avant d'utiliser l'import. Le sixième onglet (Outils) contient des liens pour différents outils utiles une fois l'import effectué.

source: Tips
fr_fr: Astuces

source: If there is already some content in this site, you should back up your database before you import.
fr_fr: S'il y a déjà du contenu dans ce site vous devriez sauvegarder votre base de donnée avant l'import.

source: Before you import, deactivate any crosspost or notification plugins.
fr_fr: Avant l'import, désactivez tout plugin de notification ou crosspost.

source: Try uploading a single file before you run the importer on the whole directory. Check the imported page and see whether you need to adjust your content and/or title settings.
fr_fr: Essayez d'importer un fichier seul avant d'exécuter l'import sur un répertoire entier. Vérifiez si la page importée est correcte ou nécessite d'ajuster les réglages.

source: Need to import both posts and pages? Run the importer on a subdirectory ( e.g. 'news' ), then add the subdirectory name to the list of skipped directories and run the importer again on the parent directory.
fr_fr: Besoin d'importer des articles et des pages ? Exécutez une première fois l'import sur un sous-répertoire (ex : 'news'), plus ajoutez ce sous-répertoire à la liste des répertoires non traités, puis exécutez à nouveau l'import sur le répertoire racine.

source: More Help
fr_fr: Plus d'aide

source: User Guide
fr_fr: Guide d'utilisation

source: Plugin Home Page
fr_fr: Page d'accueil du plugin

source: Support Forum
fr_fr: Forum de support

source: Settings
fr_fr: Réglages

source: HTML Importer
fr_fr: Import HTML

source: It looks like you have not yet visited the <a href="%s">HTML Import options page</a>. Please do so now! You need to specify which portions of your HTML files should be imported before you proceed.
fr_fr: Il semblerait que vous n'ayez pas encore visité la <a href="%s">page des options d'Import HTML</a>. Merci de le faire maintenant. Vous devez spécifier quelles portions de vos fichiers HTML doivent être importées avant de continuer.

source: What are you importing today?
fr_fr: Que souhaitez-vous importer aujourd'hui ?

source: a directory of files
fr_fr: un répertoire de fichiers

source: a single file
fr_fr: un fichier unique

source: Choose an HTML file from your computer:
fr_fr: Choisissez un fichier HTML depuis votre ordinateur :

source: Your files will be imported from <kbd>%s</kbd>. <a href="%s">Change directories</a>.
fr_fr: Vos fichier vont être importés depuis <kbd>%s</kbd>. <a href="%s">Changer de répertoire</a>.

source: Submit
fr_fr: Soumettre

source: .htaccess Redirects
fr_fr: Redirections .htaccess

source: Copy these lines into your <kbd>.htaccess</kbd> <em>above</em> the WordPress section.
fr_fr: Copier ces lignes dans votre <kbd>.htaccess</kbd> <em>au-dessus</em> de la section WordPress.

source: All done! You can <a href="%s">change your permalink structure</a> and <a href="%s">regenerate the redirects again</a>, or <a href="%s">start over</a>.
fr_fr: C'est fini ! Vous pouvez <a href="%s">changer la structure permalink</a> et <a href="%s">regénérez les redirections à nouveau</a>, ou <a href="%s">recommencer</a>.

source: No posts were found with the URL_before_HTML_Import custom field. Could not generate rewrite rules.
fr_fr: Aucun article trouvé avec le champ personnalité URL_before_HTML_Import. Impossible de générer les règles de redirections.

source: the uploaded file
fr_fr: le fichier chargé

source: %s ( %s ) has already been imported
fr_fr: %s (%s) a déjà été importé

source: Could not import %s. You should copy its contents manually.
fr_fr: Impossible d'importer %s. Vous devriez copier son contenu manuellement.

source: ( no title )
fr_fr: (sans titre)

source: Imported the file as %s.
fr_fr: Fichier importé sous %s.

source: Could not find the right path to %s ( tried %s ). It could not be imported. Please upload it manually.
fr_fr: Impossible de trouver le bon chemin vers %s (essayé : %s). Il n'a pas pu être importé. Merci de l'importer manuellement.

source: Found %d image in <a href="%s">%s</a>. Importing...
fr_fr: Trouvé %d image dans <a href="%s">%s</a>. Import en cours...

source: done.
fr_fr: fini.

source: Found %d link in <a href="%s">%s</a>. Checking file types...
fr_fr: Trouvé %d lien dans <a href="%s">%s</a>. Vérification du type du fichier...

source: Fixing relative links...
fr_fr: Correction des liens relatifs...

source: The importer is searching your imported posts for links. This might take a few minutes.
fr_fr: Le plugin d'import recherche des liens dans les articles importés. Cela peut prendre quelques minutes.

source: All done!
fr_fr: Tout fini !

source: No posts were found with the URL_before_HTML_Import custom field. Could not search for links.
fr_fr: Aucun article trouvé avec le champ personnalité URL_before_HTML_Import. Impossible de générer les règles de redirections.

source: Importing images...
fr_fr: Import des images...

source: All done. <a href="%s">Go to the Media Library.</a>
fr_fr: Tout est fini. <a href="%s">Aller à la Media Library.</a>

source: Importing media files...
fr_fr: Import des fichiers media...

source: The importer is searching your imported posts for links to media files. This might take a few minutes.
fr_fr: Le plugin d'import recherche des médias dans les articles importés. Cela peut prendre quelques minutes.

source: Old path
fr_fr: Ancien chemin

source: New path
fr_fr: Nouveau chemin

source: Title
fr_fr: Titre

source: If you need to <a href="%s">change your permalink structure</a>, you can <a href="%s">regenerate the redirects</a> ( or do it later from the <a href="%s">options screen</a> under Tools ).
fr_fr: Si vous avez besoin de <a href="%s">changer votre structure permalink</a>, vous pouvez <a href="%s">regénérer les redirections</a> (ou le faire plus tard depuis l'<a href="%s">écran des options</a>, onglet Outils).

source: All done. <a href="%s">Have fun!</a>
fr_fr: C'est tout fini. <a href="%s">Have fun!</a>

source: Importing HTML file...
fr_fr: Import du fichier HTML...

source: Importing HTML files...
fr_fr: Import des fichiers HTML...

source: Your file upload didn't work. Try again?
fr_fr: Votre import de fichier n'a pas fonctionné. Recommencer ?

source: Import the contents of HTML files as posts, pages, or any custom post type. Visit <a href="%s">the options page</a> first to select which portions of your documents should be imported.
fr_fr: Importer le contenu de fichiers HTML comme articles, pages ou tout autre type personnalisé. Visitez <a href="%s">la page d'options</a> auparavant pour sélectionner quelles portions de vos fichiers doivent être importées.
